Revit 2027 API
AreaBasedLoadData.ApparentLoad Property
 The electrical apparent load of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApparentLoad { get; }
Public ReadOnly Property ApparentLoad As Double
	Get
public:
property double ApparentLoad {
	double get ();
}
member ApparentLoad : float with get
Property Value
Double
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace